adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51N19A.PIC
      <edc:SFRDef edc:access="------nn------nn--n--nnn-n---nnn" edc:addr="0x40003004" edc:cname="CTRLB" edc:impl="0x3032747" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="CHSIZE" edc:desc="Character Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 Bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9 Bits" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="5_BIT" edc:desc="5 Bits" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="6_BIT" edc:desc="6 Bits" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="7_BIT" edc:desc="7 Bits" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SBMODE" edc:desc="Stop Bit Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="1_BIT" edc:desc="One Stop Bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_BIT" edc:desc="Two Stop Bits" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="COLDEN" edc:desc="Collision Detection Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFDE" edc:desc="Start of Frame Detection Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENC" edc:desc="Encoding Format" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PMODE" edc:desc="Parity Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even Parity" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd Parity" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LINCMD" edc:desc="LIN Command" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nn-nnn--nn----nnnn-----nnn" edc:addr="0x40003008" edc:cname="CTRLC" edc:impl="0x3730F07" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="GTIME" edc:desc="Guard Time" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BRKLEN" edc:desc="LIN Master Break Length" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="HDRDLY" edc:desc="LIN Master Header Delay" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="INACK" edc:desc="Inhibit Not Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSNACK" edc:desc="Disable Successive NACK" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MAXITER" edc:desc="Maximum Iterations" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:desc="Data 32 Bit" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DATA_READ_WRITE_CHSIZE" edc:desc="Data reads and writes according CTRLB.CHSIZE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA_READ_CHSIZE_WRITE_32BIT" edc:desc="Data reads according CTRLB.CHSIZE and writes according 32-bit extension" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA_READ_32BIT_WRITE_CHSIZE" edc:desc="Data reads according 32-bit extension and writes according CTRLB.CHSIZE" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DATA_READ_WRITE_32BIT" edc:desc="Data reads and writes according 32-bit extension" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x40003028" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0x4000300C" edc:cname="BAUD" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="BAUD" edc:desc="Baud Rate Value" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="-3"/>
            <edc:SFRFieldDef edc:cname="FP" edc:desc="Fractional Part" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x4000300E" edc:cname="RXPL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="RXPL" edc:desc="Receive Pulse Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0x40003030" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:desc="Debug Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x40003014" edc:cname="INTENCLR" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x40003016" edc:cname="INTENSET" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x40003018" edc:cname="INTFLAG" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnn" edc:addr="0x4000301A" edc:cname="STATUS" edc:impl="0xFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Parity Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Frame Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:desc="Buffer Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:desc="Clear To Send" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISF" edc:desc="Inconsistent Sync Field" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLL" edc:desc="Collision Detected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXE" edc:desc="Transmitter Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Maximum Number of Repetitions Reached" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------rrrrr" edc:addr="0x4000301C" edc:cname="SYNCBUSY" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SERCOM Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="CTRLB Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXERRCNT" edc:desc="RXERRCNT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:desc="LENGTH Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM2/SPIS">
      <edc:SFRDef edc:access="-nnnnnnn--nn--nn-------nn--nnnnn" edc:addr="0x41012000" edc:cname="CTRLA" edc:impl="0x7F33019F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="USART_EXT_CLK" edc:desc="USART with external clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="USART_INT_CLK" edc:desc="USART with internal clock" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI in slave operation" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI in master operation" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="I2C_SLAVE" edc:desc="I2C slave operation" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="I2C_MASTER" edc:desc="I2C master operation" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IBON" edc:desc="Immediate Buffer Overflow Notification" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DOPO" edc:desc="Data Out Pinout" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="DO on PAD[0], SCK on PAD[1] and SS on PAD[2]" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PAD2" edc:desc="DO on PAD[3], SCK on PAD[1] and SS on PAD[2]" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIPO" edc:desc="Data In Pinout" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="SERCOM PAD[0] is used as data input" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PAD1" edc:desc="SERCOM PAD[1] is used as data input" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PAD2" edc:desc="SERCOM PAD[2] is used as data input" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PAD3" edc:desc="SERCOM PAD[3] is used as data input" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FORM" edc:desc="Frame Format" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="SPI_FRAME" edc:desc="SPI Frame" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SPI_FRAME_WITH_ADDR" edc:desc="SPI Frame with Addr" edc:when="(field &amp; 0xF) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:desc="Clock Phase" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LEADING_EDGE" edc:desc="The data is sampled on a leading SCK edge and changed on a trailing SCK edge" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRAILING_EDGE" edc:desc="The data is sampled on a trailing SCK edge and changed on a leading SCK edge" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="SCK is low when idle" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="SCK is high when idle" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DORD" edc:desc="Data Order" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MSB" edc:desc="MSB is transferred first" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LSB" edc:desc="LSB is transferred first" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------nnnnnnnnn" edc:addr="0x41012022" edc:cname="LENGTH" edc:impl="0x1FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:SFRFieldDef edc:cname="LEN" edc:desc="Data Length" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="LENEN" edc:desc="Data Length Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------n-nnn---n--n---nnn" edc:addr="0x41012004" edc:cname="CTRLB" edc:impl="0x2E247" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:SFRFieldDef edc:cname="CHSIZE" edc:desc="Character Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9 bits" edc:when="(field &amp; 0x7) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PLOADEN" edc:desc="Data Preload Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SSDE" edc:desc="Slave Select Low Detect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MSSEN" edc:desc="Master Slave Select Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMODE" edc:desc="Address Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="SPI Address mask " edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_ADDRESSES" edc:desc="Two unique Addressess" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RANGE" edc:desc="Address Range" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnn--------nnnnnnnn" edc:addr="0x41012024" edc:cname="ADDR" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address Value" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:desc="Address Mask" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n------------------nnnnnn" edc:addr="0x41012008" edc:cname="CTRLC" edc:impl="0x100003F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM2">
            <edc:SFRFieldDef edc:cname="ICSPACE" edc:desc="Inter-Character Spacing" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:desc="Data 32 Bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_8BIT" edc:desc="Transaction from and to DATA register are 8-bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_32BIT" edc:desc="Transaction from and to DATA register are 32-bit" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
